#include <stdio.h>

void f(int** i)
{
	*i = 222;
}

void g(int *i)
{
	printf("int g:%p\n", i);
	*i = 999;
	printf("int g:%d\n", i);
}

int main()                      //-----------------------------------特别低级的错误↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓-------------------------------------------
{                           
	int* a = 426;          //注：！！！   没这种定义的写法的，一般都是把一个变量的地址赋给指针变量！这么写，就相当于赋给指针变量a的值是426，这个426被理解为是一个地址，错误！！！！！  
	printf("*a:%d\n", &a);
	printf("*a:%d, a:%d, &a:%d\n", &a, a, &a);
	f(&a);
	printf("%d\n", a);

	int* b = 123;
	printf("&b:%d\n", &b);
	g(&b);
	printf("***&b:%d\n", &b);
	printf("b:%d\n", b);

	int i = 789;
//	int* p = 0;
//	p = i;
	int* p = i;			
	printf("p:%d,&p:%d\n", p, &p);   //！！！注：这里不能写printf("*p:%d", *p); 因为这里指针p里存放的地址是i的值789，如果用*p取地址符输出地址789上的内容，就会报错！！！
	printf("&i:%d\n", &i);
                                                          //--------------------------上下这两个注释行，对比！！！！！---------------------------------
	int* q = &i;
	printf("q:%d, *q:%d, &q:%d\n", q, *q, &q);  //这里能输出*p，是因为在定义指针q的时候用取地址符&,把变量i的地址赋给了指针变量，所以之后输出的时候能用*取地址内容，输出地址q上的内容
				//这里，q是输出指针变量q中存储的地址、*q是输出指针变量q存储的地址上的内容、&q输出的是指针变量q本身在系统中存储的地址值
	return 0;
}
